data/load_test_results/scenario_a_cache_20260626_135630.txt
Summary:
  Total:	0.4834 secs
  Slowest:	0.0997 secs
  Fastest:	0.0021 secs
  Average:	0.0229 secs
  Requests/sec:	2068.8248
  
  Total data:	122000 bytes
  Size/request:	122 bytes

Response time histogram:
  0.002 [1]	|
  0.012 [172]	|■■■■■■■■■■■■■■■■
  0.022 [237]	|■■■■■■■■■■■■■■■■■■■■■■
  0.031 [439]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [62]	|■■■■■■
  0.051 [62]	|■■■■■■
  0.061 [12]	|■
  0.070 [11]	|■
  0.080 [2]	|
  0.090 [0]	|
  0.100 [2]	|


Latency distribution:
  10%% in 0.0034 secs
  25%% in 0.0196 secs
  50%% in 0.0225 secs
  75%% in 0.0259 secs
  90%% in 0.0404 secs
  95%% in 0.0471 secs
  99%% in 0.0651 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0000 secs, 0.0245 secs
  DNS-lookup:	0.0008 secs, 0.0000 secs, 0.0217 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.0218 secs, 0.0020 secs, 0.0921 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0016 secs

Status code distribution:
  [200]	1000 responses