data/load_test_results/scenario_b_nomatch_20260626_135306.txt
Summary:
  Total:	0.2966 secs
  Slowest:	0.0385 secs
  Fastest:	0.0028 secs
  Average:	0.0109 secs
  Requests/sec:	1685.7937
  
  Total data:	61016 bytes
  Size/request:	122 bytes

Response time histogram:
  0.003 [1]	|
  0.006 [66]	|■■■■■■■■■■■■■■■
  0.010 [176]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [165]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [53]	|■■■■■■■■■■■■
  0.021 [13]	|■■■
  0.024 [9]	|■■
  0.028 [6]	|■
  0.031 [7]	|■■
  0.035 [3]	|■
  0.038 [1]	|


Latency distribution:
  10%% in 0.0050 secs
  25%% in 0.0087 secs
  50%% in 0.0100 secs
  75%% in 0.0124 secs
  90%% in 0.0161 secs
  95%% in 0.0215 secs
  99%% in 0.0312 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0167 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.0131 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0015 secs
  resp wait:	0.0101 secs, 0.0026 secs, 0.0249 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [200]	500 responses