data/load_test_results/scenario_b_nomatch_20260626_135630.txt
Summary:
  Total:	0.4199 secs
  Slowest:	0.0670 secs
  Fastest:	0.0029 secs
  Average:	0.0163 secs
  Requests/sec:	1190.7549
  
  Total data:	61000 bytes
  Size/request:	122 bytes

Response time histogram:
  0.003 [1]	|
  0.009 [91]	|■■■■■■■■■■■■■■■■■■■■■
  0.016 [172]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [150]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [51]	|■■■■■■■■■■■■
  0.035 [16]	|■■■■
  0.041 [7]	|■■
  0.048 [6]	|■
  0.054 [3]	|■
  0.061 [1]	|
  0.067 [2]	|


Latency distribution:
  10%% in 0.0057 secs
  25%% in 0.0115 secs
  50%% in 0.0154 secs
  75%% in 0.0198 secs
  90%% in 0.0262 secs
  95%% in 0.0317 secs
  99%% in 0.0509 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0000 secs, 0.0205 secs
  DNS-lookup:	0.0006 secs, 0.0000 secs, 0.0146 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0022 secs
  resp wait:	0.0154 secs, 0.0028 secs, 0.0482 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0018 secs

Status code distribution:
  [200]	500 responses